# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

anchors:
  - [4,5,  6,8,  10,12]  # P3/8
  - [15,19,  23,30,  39,52]  # P4/16
  - [72,97,  123,164,  209,297]  # P5/32


# custom backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [32, 3, 2, None, 1, nn.ReLU6()]],    # 0 : conv0
    
    [-1, 1, Conv, [32, 3, 2, None, 1, nn.ReLU6()]],    
    [-1, 1, Conv, [32, 1, 1, None, 1, nn.ReLU6()]],    # 2 : layer1

    [-1, 1, Conv, [96, 3, 2, None, 1, nn.ReLU6()]],    
    [-1, 1, Conv, [64, 1, 1, None, 1, nn.ReLU6()]],    # 4 : layer2
    
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 5, 5, True, 2, 3]],
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 0, 3, True, 1, 2]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 0, 3, True, 1, 2]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 0, 3, True, 1, 2]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 0, 3, True, 1, 2]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 3, 0, True, 1, 4]],     # 10 : layer3
    
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 3, 3, True, 2, 6]],
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 5, 5, True, 1, 4]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 0, 5, True, 1, 4]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 0, 5, True, 1, 3]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 0, 3, True, 1, 4]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 0, 3, True, 1, 4]],    # 16 : layer4
  ]

# v5lite-e head
head:
  [ [ -1, 1, Conv, [48, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 17
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 10], 1, Concat, [1]],  # cat backbone P4
    [ -1, 1, DWConvblock, [48, 3, 1]],  # 20

    [ -1, 1, Conv, [48, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 21
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 4], 1, Concat, [1]],  # cat backbone P3
    [ -1, 1, DWConvblock, [48, 3, 1] ],  # 24 (P3/8-small)

    [-1, 1, DWConvblock, [48, 3, 2]],
    [[ -1, 21], 1, ADD, [1]],  # cat head P4
    [ -1, 1, DWConvblock, [48, 3, 1]],  # 27 (P4/16-medium)

    [ -1, 1, DWConvblock, [48, 3, 2]],
    [[ -1, 17], 1, ADD, [1]],  # cat head P5
    [ -1, 1, DWConvblock, [48, 3, 1]],  # 30 (P5/32-large)

    [[ 24, 27, 30], 1, IDetect, [nc, anchors]],  # Detect(P3, P4, P5)

   ]
