# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [  
   [-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]], # 0
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 1, 2, None, 1, nn.LeakyReLU(0.1)]], # 2
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [256, 1, 2, None, 1, nn.LeakyReLU(0.1)]],  # 4
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [512, 1, 2, None, 1, nn.LeakyReLU(0.1)]],  # 6
  ]

# yolov7-tiny head
head:
  [
   [2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 7
   [4, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 8
   [6, 1, Conv, [512, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 9

   [[7, 8, 9], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]