# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

anchors:
  - [4,5,  6,8,  10,12]  # P3/8
  - [15,19,  23,30,  39,52]  # P4/16
  - [72,97,  123,164,  209,297]  # P5/32


# custom backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],    # 0 : conv0
    
    [-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],    # 1 : layer1
    [-1, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],    

    [-1, 1, Conv, [96, 3, 2, None, 1, nn.LeakyReLU(0.1)]],    # 3 : layer2
    [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  
    
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 5, 5, True, 2, 3]],    # 5 : layer3
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 0, 3, True, 1, 2]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 0, 3, True, 1, 2]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 0, 3, True, 1, 2]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 0, 3, True, 1, 2]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [96, 3, 0, True, 1, 4]], 
    
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 3, 3, True, 2, 6]],    # 11 : layer4
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 5, 5, True, 1, 4]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 0, 5, True, 1, 4]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 0, 5, True, 1, 3]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 0, 3, True, 1, 4]], 
    [-1, 1, UniversalInvertedBottleneckBlock, [128, 0, 3, True, 1, 4]], 

    #for head
    [-1, 1, Conv, [960, 1, 1, None, 1, nn.LeakyReLU(0.1)]],    # 17 : layer5
    [-1, 1, Conv, [1280, 1, 1, None, 1, nn.LeakyReLU(0.1)]],   # 18
  ]