# parameters
nc: 80  # number of classes
depth_multiple: 0.25 # model depth multiple
width_multiple: 0.25 # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 0-P1/2  
  
   [-1, 1, Conv, [64, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 1-P2/4    
   
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 6 -> 3
   
   [-1, 1, ADown, [128]],  # 4
   
   [-1, 1, ADown, [256]],  # 5
   
   [-1, 1, ADown, [256]],  # 6
  ]

# yolov7-tiny head
head:
  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 7
  
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 8
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [5, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 13
  
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [4, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   
   [-1, 1, ADown, [128]],  # 18
   [[-1, 13], 1, Concat, [1]],
   
   [-1, 1, ADown, [256]],  # 20
   [[-1, 7], 1, Concat, [1]],
      
   [17, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [19, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [21, 1, Conv, [512, 3, 1, None, 1, nn.LeakyReLU(0.1)]],

   [[22,23,24], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
