# parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

anchors:
  - [4,5,  6,8,  10,12]  # P3/8
  - [15,19,  23,30,  39,52]  # P4/16
  - [72,97,  123,164,  209,297]  # P5/32

# custom backbone
backbone:
  # [from, number, module, args]
  [ [-1, 1, Conv, [32, 3, 2, None, 1, nn.ReLU()]],    # 0-P2/4
    [ -1, 1, InvertedResidualBlockReLU, [32, 2]], # 1-P3/8
    [ -1, 3, InvertedResidualBlockReLU, [32, 1]], # 2
    [ -1, 1, InvertedResidualBlockReLU, [48, 2]], # 3-P4/16
    [ -1, 7, InvertedResidualBlockReLU, [48, 1]], # 4
    [ -1, 1, InvertedResidualBlockReLU, [96, 2]], # 5-P5/32
    [ -1, 3, InvertedResidualBlockReLU, [96, 1]], # 6
  ]

# v5lite-e head
head:
  [ [ -1, 1, Conv, [48, 1, 1, None, 1, nn.ReLU()]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 4], 1, Concat, [1]],  # cat backbone P4
    [ -1, 1, DWConvblocknoBN, [48, 3, 1]],  # 11

    [ -1, 1, Conv, [48, 1, 1, None, 1, nn.ReLU()]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 2], 1, Concat, [1]],  # cat backbone P3
    [ -1, 1, DWConvblocknoBN, [48, 3, 1] ],  # 15 (P3/8-small)

    [-1, 1, DWConvblocknoBN, [48, 3, 2]],
    [[ -1, 11], 1, ADD, [1]],  # cat head P4
    [ -1, 1, DWConvblocknoBN, [48, 3, 1]],  # 18 (P4/16-medium)

    [ -1, 1, DWConvblocknoBN, [48, 3, 2]],
    [[ -1, 7], 1, ADD, [1]],  # cat head P5
    [ -1, 1, DWConvblocknoBN, [48, 3, 1]],  # 21 (P5/32-large)

    [[ 14, 17, 20], 1, IDetect, [nc, anchors]],  # Detect(P3, P4, P5)

   ]
